Repository: NexusRetail-RSMS/NexusRetail
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, es, fr, hi

source: Welcome
ar: مرحباً
es: Bienvenido
fr: Accueillir
hi: स्वागत

source: Sign in to continue to your account
ar: قم بتسجيل الدخول للمتابعة إلى حسابك
es: Inicia sesión para continuar con tu cuenta
fr: Connectez-vous pour continuer avec votre compte
hi: अपने खाते को जारी रखने के लिए साइन इन करें

source: Forgot password?
ar: هل نسيت كلمة السر؟
es: ¿Has olvidado tu contraseña?
fr: Mot de passe oublié ?
hi: पासवर्ड भूल गए?

source: NexusRetail
ar: نيكزس ريتيل
hi: नेक्ससरिटेल

source: Sign In
ar: تسجيل الدخول
es: Iniciar sesión
fr: Se connecter
hi: दाखिल करना

source: Email address or username
ar: عنوان البريد الإلكتروني أو اسم المستخدم
es: Dirección de correo electrónico o nombre de usuario
fr: Adresse e-mail ou nom d'utilisateur
hi: ईमेल पता या उपयोगकर्ता नाम

source: Password
ar: كلمة المرور
es: Contraseña
fr: Mot de passe
hi: पासवर्ड

source: Sign in
ar: تسجيل الدخول
es: Iniciar sesión
fr: Se connecter
hi: दाखिल करना

source: No revenue data available
ar: لا توجد بيانات الإيرادات المتاحة
es: No hay datos de ingresos disponibles
fr: Aucune donnée sur les revenus disponible
hi: कोई राजस्व डेटा उपलब्ध नहीं है

source: TODAY'S REVENUE
ar: إيرادات اليوم
es: INGRESOS DE HOY
fr: REVENUS D'AUJOURD'HUI
hi: आज का राजस्व

source: vs yesterday
ar: مقابل أمس
es: vs ayer
fr: contre hier
hi: बनाम कल

source: Staff Performance
ar: أداء الموظفين
es: Desempeño del personal
fr: Performance du personnel
hi: स्टाफ प्रदर्शन

source: No staff data available
ar: لا توجد بيانات الموظفين المتاحة
es: No hay datos de personal disponibles
fr: Aucune donnée sur le personnel disponible
hi: कोई स्टाफ डेटा उपलब्ध नहीं है

source: Revenue History
ar: تاريخ الإيرادات
es: Historial de ingresos
fr: Historique des revenus
hi: राजस्व इतिहास

source: Low Stock
ar: مخزون منخفض
es: Existencias bajas
fr: Stock faible
hi: कम स्टॉक

source: Returns
ar: المرتجعات
es: Devoluciones
fr: Retours
hi: रिटर्न

source: Stock Levels Healthy
ar: مستويات المخزون صحية
es: Niveles de existencias saludables
fr: Des niveaux de stocks sains
hi: स्टॉक स्तर स्वस्थ

source: No items are currently below their reorder threshold.
ar: لا توجد عناصر حاليًا أقل من عتبة إعادة الطلب الخاصة بها.
es: Actualmente, ningún artículo está por debajo de su umbral de reorden.
fr: Aucun article n'est actuellement en dessous de son seuil de réapprovisionnement.
hi: वर्तमान में कोई भी आइटम उनकी पुनः ऑर्डर सीमा से नीचे नहीं है।

source: No Pending Requests
ar: لا توجد طلبات معلقة
es: No hay solicitudes pendientes
fr: Aucune demande en attente
hi: कोई लंबित अनुरोध नहीं

source: There are currently no store transfer requests.
ar: لا يوجد حاليا أي طلبات نقل المتجر.
es: Actualmente no hay solicitudes de transferencia de tienda.
fr: Il n’y a actuellement aucune demande de transfert de magasin.
hi: वर्तमान में कोई स्टोर स्थानांतरण अनुरोध नहीं है.

source: No After-Sales Tickets
ar: لا تذاكر ما بعد البيع
es: Sin boletos posventa
fr: Pas de billets après-vente
hi: बिक्री के बाद का कोई टिकट नहीं

source: There are no returns or repairs logged for this store.
ar: لا توجد عمليات إرجاع أو إصلاحات مسجلة لهذا المتجر.
es: No se han registrado devoluciones ni reparaciones para esta tienda.
fr: Il n'y a aucun retour ou réparation enregistré pour ce magasin.
hi: इस स्टोर के लिए कोई रिटर्न या मरम्मत लॉग नहीं किया गया है।

source: Store Settings
ar: إعدادات المتجر
es: Configuración de la tienda
fr: Paramètres du magasin
hi: स्टोर सेटिंग्स

source: Events
ar: الأحداث
es: Eventos
fr: Événements
hi: घटनाएँ

source: Pending
ar: قيد الانتظار
es: Pendiente
fr: En attente
hi: लंबित

source: Routed
ar: موجهة
es: Enrutado
fr: Acheminé
hi: कराई

source: Dispatched
ar: مُرسَل
es: Enviado
fr: Expédié
hi: भेजा गया

source: Delivered
ar: تم التوصيل
es: Entregado
fr: Livré
hi: पहुंचा दिया

source: Unfulfillable
ar: غير قابلة للوفاء
es: Incumplible
fr: Inexécutable
hi: अपूर्ण

source: Inventory
ar: جرد
es: Inventario
fr: Inventaire
hi: भंडार

source: Stock Requests
ar: طلبات الأسهم
es: Solicitudes de stock
fr: Demandes de stock
hi: स्टॉक अनुरोध

source: Scan to Add to Cart
ar: قم بالمسح الضوئي للإضافة إلى سلة التسوق
es: Escanear para agregar al carrito
fr: Numériser pour ajouter au panier
hi: कार्ट में जोड़ने के लिए स्कैन करें

source: No requests
ar: لا طلبات
es: Sin solicitudes
fr: Aucune demande
hi: कोई अनुरोध नहीं

source: You haven't submitted any stock transfer requests matching this filter.
ar: لم تقم بإرسال أي طلبات لنقل المخزون مطابقة لهذا الفلتر.
es: No ha enviado ninguna solicitud de transferencia de acciones que coincida con este filtro.
fr: Vous n'avez soumis aucune demande de transfert de titres correspondant à ce filtre.
hi: आपने इस फ़िल्टर से मेल खाने वाला कोई भी स्टॉक ट्रांसफ़र अनुरोध सबमिट नहीं किया है।

source: Quantity
ar: كمية
es: Cantidad
fr: Quantité
hi: मात्रा

source: Request Sent
ar: تم إرسال الطلب
es: Solicitud enviada
fr: Demande envoyée
hi: निमंत्रण भेजा गया

source: Sending\u{2026}
ar: جارٍ الإرسال{2026}
es: Enviando\u{2026}
fr: Envoi\u{2026}
hi: भेजा जा रहा है\u{2026}

source: Submit Request
ar: إرسال الطلب
es: Enviar solicitud
fr: Soumettre la demande
hi: अनुरोध सबमिट करें

source: Request Stock
ar: طلب المخزون
es: Solicitar stock
fr: Demander du stock
hi: स्टॉक का अनुरोध करें

source: Store Events
ar: أحداث المتجر
es: Eventos de la tienda
fr: Événements en magasin
hi: स्टोर इवेंट

source: Track and organize upcoming promotional events and product launches.
ar: تتبع وتنظيم الأحداث الترويجية القادمة وإطلاق المنتجات.
es: Realice un seguimiento y organice los próximos eventos promocionales y lanzamientos de productos.
fr: Suivez et organisez les événements promotionnels et les lancements de produits à venir.
hi: आगामी प्रचार कार्यक्रमों और उत्पाद लॉन्च को ट्रैक और व्यवस्थित करें।

source: Notify Me
ar: أعلمني
es: Notificarme
fr: Prévenez-moi
hi: मुझे सूचित करें

source: What you can do
ar: ما يمكنك القيام به
es: que puedes hacer
fr: Ce que tu peux faire
hi: आप क्या कर सकते हैं

source: Upcoming Events
ar: الأحداث القادمة
es: Próximos eventos
fr: Événements à venir
hi: आगामी कार्यक्रम

source: View All
ar: عرض الكل
es: Ver todo
fr: Tout afficher
hi: सभी को देखें

source: Event Details
ar: تفاصيل الحدث
es: Detalles del evento
fr: Détails de l'événement
hi: घटना विवरण

source: Create
ar: يخلق
es: Crear
fr: Créer
hi: बनाएं

source: Create new event
ar: إنشاء حدث جديد
es: Crear nuevo evento
fr: Créer un nouvel événement
hi: नया ईवेंट बनाएं

source: Create Event
ar: إنشاء حدث
es: Crear evento
fr: Créer un événement
hi: ईवेंट बनाएं

source: Employees
ar: موظفين
es: Empleados
fr: Employés
hi: कर्मचारी

source: Employee Details
ar: تفاصيل الموظف
es: Detalles del empleado
fr: Détails de l'employé
hi: कर्मचारी विवरण

source: Role
ar: دور
fr: Rôle
hi: भूमिका

source: Edit Employee
ar: تحرير الموظف
es: Editar empleado
fr: Modifier un employé
hi: कर्मचारी संपादित करें

source: Customer Attraction
ar: جذب العملاء
es: Atracción de clientes
fr: Attraction client
hi: ग्राहक आकर्षण

source: Delete Employee
ar: حذف الموظف
es: Eliminar empleado
fr: Supprimer un employé
hi: कर्मचारी हटाएँ

source: Are you sure you want to delete this employee? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا الموظف؟ لا يمكن التراجع عن هذا الإجراء.
es: ¿Está seguro de que desea eliminar a este empleado? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir supprimer cet employé ? Cette action ne peut pas être annulée.
hi: क्या आप वाकई इस कर्मचारी को हटाना चाहते हैं? इस एक्शन को वापस नहीं किया जा सकता।

source: Employee Detail
ar: تفاصيل الموظف
es: Detalle del empleado
fr: Détail de l'employé
hi: कर्मचारी विवरण

source: New Employee
ar: موظف جديد
es: Nuevo empleado
fr: Nouvel employé
hi: नया कर्मचारी

source: Team Overview
ar: نظرة عامة على الفريق
es: Descripción general del equipo
fr: Aperçu de l'équipe
hi: टीम अवलोकन

source: Total Employees
ar: إجمالي الموظفين
es: Empleados totales
fr: Nombre total d'employés
hi: कुल कर्मचारी

source: No Employees Found
ar: لم يتم العثور على موظفين
es: No se encontraron empleados
fr: Aucun employé trouvé
hi: कोई कर्मचारी नहीं मिला

source: No employee matches your search or role filter.
ar: لا يوجد موظف يطابق بحثك أو مرشح الدور الخاص بك.
es: Ningún empleado coincide con su búsqueda o filtro de rol.
fr: Aucun employé ne correspond à votre recherche ou à votre filtre de rôle.
hi: कोई भी कर्मचारी आपकी खोज या भूमिका फ़िल्टर से मेल नहीं खाता।

source: Add new employee
ar: إضافة موظف جديد
es: Agregar nuevo empleado
fr: Ajouter un nouvel employé
hi: नया कर्मचारी जोड़ें

source: Appointments
ar: المواعيد
es: Equipo
fr: Rendez-vous
hi: नियुक्ति

source: No upcoming appointments scheduled.
ar: لا توجد مواعيد قادمة مجدولة.
es: No hay próximas citas programadas.
fr: Aucun rendez-vous à venir prévu.
hi: कोई आगामी नियुक्ति निर्धारित नहीं है.

source: New Appointment
ar: موعد جديد
es: Nueva cita
fr: Nouveau rendez-vous
hi: नई नियुक्ति

source: Type
ar: يكتب
es: Tipo
fr: Taper
hi: प्रकार

source: In Store
ar: في المتجر
es: En la tienda
fr: En magasin
hi: स्टोर में

source: Video
ar: فيديو
fr: Vidéo
hi: वीडियो

source: The appointment invitation has been successfully sent to the client.
ar: تم إرسال دعوة الموعد بنجاح إلى العميل.
es: La invitación a la cita ha sido enviada exitosamente al cliente.
fr: L'invitation au rendez-vous a été envoyée avec succès au client.
hi: नियुक्ति आमंत्रण ग्राहक को सफलतापूर्वक भेज दिया गया है।

source: Client Details
ar: تفاصيل العميل
es: Detalles del cliente
fr: Détails du client
hi: ग्राहक विवरण

source: Appointment
ar: ميعاد
es: Cita
fr: Rendez-vous
hi: नियुक्ति

source: Email Sent
ar: تم إرسال البريد الإلكتروني
es: Correo electrónico enviado
fr: E-mail envoyé
hi: ईमेल भेजा गया

source: Items
ar: أغراض
es: Elementos
fr: Articles
hi: सामान

source: Verification Code:
ar: رمز التحقق:
es: Código de verificación:
fr: Le code de vérification:
hi: सत्यापन कोड:

source: No Completed Orders
ar: لا توجد أوامر مكتملة
es: No hay pedidos completados
fr: Aucune commande terminée
hi: कोई पूर्ण आदेश नहीं

source: Orders you mark as collected will appear here.
ar: ستظهر هنا الطلبات التي حددتها على أنها مجمعة.
es: Los pedidos que marques como recogidos aparecerán aquí.
fr: Les commandes que vous marquez comme collectées apparaîtront ici.
hi: आपके द्वारा एकत्र किए गए के रूप में चिह्नित किए गए ऑर्डर यहां दिखाई देंगे।

source: Mark as Packed
ar: وضع علامة معبأة
es: Marcar como empaquetado
fr: Marquer comme emballé
hi: पैक्ड के रूप में चिह्नित करें

source: Scan to update inventory
ar: المسح لتحديث المخزون
es: Escanear para actualizar el inventario
fr: Scanner pour mettre à jour l'inventaire
hi: इन्वेंट्री अपडेट करने के लिए स्कैन करें

source: QR
ar: ريال قطري

source: Pack Items
ar: عناصر الحزمة
es: Paquete de artículos
fr: Pack d'articles
hi: सामान पैक करें

source: No pickup orders available
ar: لا تتوفر طلبات الاستلام
es: No hay pedidos para recoger disponibles
fr: Aucune commande de ramassage disponible
hi: कोई पिकअप ऑर्डर उपलब्ध नहीं है

# We couldn't find any orders matching your search or filter.
source: We couldn't find any orders matching\nyour search or filter.
ar: لم نتمكن من العثور على أي طلبات تطابق\nبحثك أو فلترك.
es: No pudimos encontrar ningún pedido que coincida\ncon su búsqueda o filtro.
fr: Nous n'avons trouvé aucune commande correspondant\nà votre recherche ou à votre filtre.
hi: हमें आपकी खोज या फ़िल्टर से मेल खाता कोई ऑर्डर नहीं मिला।

source: Clear Filters
ar: مسح المرشحات
es: Borrar filtros
fr: Effacer les filtres
hi: फ़िल्टर साफ़ करें

source: BOPIS
ar: بوبيس
hi: बोपिस

source: Customer Notified
ar: تم إخطار العميل
es: Cliente notificado
fr: Client informé
hi: ग्राहक को सूचित किया गया

source: Client Preferences
ar: تفضيلات العميل
es: Preferencias del cliente
fr: Préférences des clients
hi: ग्राहक प्राथमिकताएँ

source: Purchase Pattern
ar: نمط الشراء
es: Patrón de compra
fr: Modèle d'achat
hi: खरीद पैटर्न

source: For You
ar: لك
es: Para ti
fr: Pour toi
hi: आपके लिए

source: Trending
ar: تتجه
es: Tendencia
fr: Tendance
hi: रुझान

source: Client Card
ar: بطاقة العميل
es: Tarjeta de cliente
fr: Carte client
hi: ग्राहक कार्ड

source: Clients
ar: العملاء
es: Clientela
fr: Clientèle
hi: ग्राहकों

source: Manage and view your client information
ar: إدارة وعرض معلومات العميل الخاص بك
es: Gestiona y visualiza la información de tus clientes
fr: Gérez et consultez les informations de vos clients
hi: अपने ग्राहक की जानकारी प्रबंधित करें और देखें

source: Add Client
ar: إضافة عميل
es: Agregar cliente
fr: Ajouter un client
hi: क्लाइंट जोड़ें

source: Required before saving personal details.
ar: مطلوب قبل حفظ التفاصيل الشخصية.
es: Requerido antes de guardar datos personales.
fr: Obligatoire avant d’enregistrer des données personnelles.
hi: व्यक्तिगत विवरण सहेजने से पहले आवश्यक.

source: Date
ar: تاريخ
es: Fecha
hi: तारीख

source: Time
ar: وقت
es: Tiempo
fr: Temps
hi: समय

source: Edit Client
ar: تحرير العميل
es: Editar cliente
fr: Modifier le client
hi: क्लाइंट संपादित करें

source: View Purchase History
ar: عرض تاريخ الشراء
es: Ver historial de compras
fr: Afficher l'historique des achats
hi: खरीद इतिहास देखें

source: Schedule Appointment
ar: تحديد موعد
es: Programar cita
fr: Planifier un rendez-vous
hi: नियुक्ति की सूची बनाना

source: Delete Client
ar: حذف العميل
es: Eliminar cliente
fr: Supprimer le client
hi: क्लाइंट हटाएँ

source: Client consent received
ar: تم الحصول على موافقة العميل
es: Consentimiento del cliente recibido
fr: Consentement du client reçu
hi: ग्राहक की सहमति प्राप्त हुई

source: Style Preferences
ar: تفضيلات النمط
es: Preferencias de estilo
fr: Préférences de style
hi: शैली प्राथमिकताएँ

source: Consent is required before saving client details.
ar: الموافقة مطلوبة قبل حفظ تفاصيل العميل.
es: Se requiere consentimiento antes de guardar los datos del cliente.
fr: Le consentement est requis avant d’enregistrer les détails du client.
hi: ग्राहक विवरण सहेजने से पहले सहमति आवश्यक है।

source: Consented Details
ar: التفاصيل المعتمدة
es: Detalles consentidos
fr: Détails consentis
hi: सहमति विवरण

source: New Client
ar: عميل جديد
es: Nuevo cliente
fr: Nouveau client
hi: नए ग्राहक

source: Orders Hub
ar: مركز الطلبات
es: Centro de pedidos
fr: Centre de commandes
hi: ऑर्डर हब

source: View All Orders
ar: عرض جميع الطلبات
es: Ver todos los pedidos
fr: Afficher toutes les commandes
hi: सभी ऑर्डर देखें

source: Store Revenue
ar: إيرادات المتجر
es: Ingresos de la tienda
fr: Revenus du magasin
hi: भंडार राजस्व

source: Revenue in Indian Rupees (₹)
ar: الإيرادات بالروبية الهندية (₹)
es: Ingresos en rupias indias ($)
fr: Revenus en roupies indiennes ( ₹ )
hi: भारतीय रुपए में राजस्व (₹)

source: Scan QR Code
ar: مسح رمز الاستجابة السريعة
es: Escanear código QR
fr: Scanner le code QR
hi: स्कैन क्यू आर कोड

source: Search
ar: يبحث
es: Buscar
fr: Recherche
hi: खोज

source: Maximum available stock already in cart
ar: الحد الأقصى للمخزون المتاح بالفعل في سلة التسوق
es: Stock máximo disponible ya en el carrito
fr: Stock maximum disponible déjà dans le panier
hi: कार्ट में अधिकतम उपलब्ध स्टॉक पहले से ही है

source: Point camera at product barcode
ar: قم بتوجيه الكاميرا نحو الرمز الشريطي للمنتج
es: Apunte la cámara al código de barras del producto
fr: Pointez la caméra vers le code-barres du produit
hi: कैमरे को उत्पाद बारकोड पर इंगित करें

source: Upload QR Code Image
ar: تحميل صورة رمز الاستجابة السريعة
es: Cargar imagen de código QR
fr: Télécharger l'image du code QR
hi: QR कोड छवि अपलोड करें

source: Out of Stock
ar: إنتهى من المخزن
es: Agotado
fr: En rupture de stock
hi: स्टॉक ख़त्म

source: Suggested Alternatives
ar: البدائل المقترحة
es: Alternativas sugeridas
fr: Alternatives suggérées
hi: सुझाए गए विकल्प

source: No suitable alternatives found in stock.
ar: لم يتم العثور على بدائل مناسبة في المخزون.
es: No se encontraron alternativas adecuadas en stock.
fr: Aucune alternative appropriée trouvée en stock.
hi: स्टॉक में कोई उपयुक्त विकल्प नहीं मिला.

source: Add
ar: يضيف
es: Agregar
fr: Ajouter
hi: जोड़ना

source: Selected Items
ar: العناصر المحددة
es: Artículos seleccionados
fr: Articles sélectionnés
hi: चयनित आइटम

source: Your cart is empty
ar: سلة التسوق الخاصة بك فارغة
es: Tu carrito está vacío
fr: Votre panier est vide
hi: आपकी गाड़ी खाली है

source: Subtotal
ar: المجموع الفرعي
es: Total parcial
fr: Total
hi: उप-योग

source: Total Amount
ar: المبلغ الإجمالي
es: Monto total
fr: Montant total
hi: कुल राशि

source: Scan Another Item
ar: مسح عنصر آخر
es: Escanear otro artículo
fr: Scanner un autre élément
hi: किसी अन्य आइटम को स्कैन करें

source: Proceed to Checkout
ar: الشروع في الخروج
es: Pasar por la caja
fr: Passer à la caisse
hi: चेकआउट के लिए आगे बढ़ें

source: Shopping Cart
ar: سلة التسوق
es: Carro de la compra
fr: Panier
hi: शॉपिंग कार्ट

source: Order Summary
ar: ملخص الطلب
es: Resumen del pedido
fr: Récapitulatif de la commande
hi: आदेश सारांश

source: Customer Link
ar: رابط العميل
es: Enlace del cliente
fr: Lien client
hi: ग्राहक लिंक

source: Select Payment Method
ar: حدد طريقة الدفع
es: Seleccione método de pago
fr: Sélectionnez le mode de paiement
hi: भुगतान विधि चुनें

source: Look up
ar: ابحث عن
es: Buscar
fr: Chercher
hi: ऊपर देखो

source: No customer found with this number. Add a new one:
ar: لم يتم العثور على عميل بهذا الرقم. إضافة واحدة جديدة:
es: No se encontró ningún cliente con este número. Añade uno nuevo:
fr: Aucun client trouvé avec ce numéro. Ajoutez-en un nouveau :
hi: इस नंबर वाला कोई ग्राहक नहीं मिला. एक नया जोड़ें:

source: Look up a customer by phone to attach them, or continue anonymously.
ar: ابحث عن عميل عبر الهاتف لإرفاقه، أو تابع بشكل مجهول.
es: Busque un cliente por teléfono para adjuntarlo o continúe de forma anónima.
fr: Recherchez un client par téléphone pour le joindre ou continuez de manière anonyme.
hi: किसी ग्राहक को संलग्न करने के लिए उसे फ़ोन द्वारा खोजें, या गुमनाम रूप से जारी रखें।

source: Continue as Anonymous / Skip
ar: متابعة كمجهول / تخطي
es: Continuar como anónimo/saltar
fr: Continuer en tant qu'Anonyme / Passer
hi: अज्ञात के रूप में जारी रखें / छोड़ें

source: Checkout
ar: الدفع
es: Verificar
fr: Vérifier
hi: चेक आउट

source: Finalize & Authorize Payment
ar: وضع اللمسات النهائية والتفويض بالدفع
es: Finalizar y autorizar el pago
fr: Finaliser et autoriser le paiement
hi: भुगतान को अंतिम रूप दें और अधिकृत करें

source: Change
ar: يتغير
es: Cambiar
fr: Changement
hi: परिवर्तन

source: How would you like to add products?
ar: كيف تريد إضافة المنتجات؟
es: ¿Cómo le gustaría agregar productos?
fr: Comment souhaitez-vous ajouter des produits ?
hi: आप उत्पाद कैसे जोड़ना चाहेंगे?

source: Order
ar: طلب
es: Orden
fr: Commande
hi: आदेश

source: In-Store & BOPIS
ar: في المتجر وBOPIS
es: En tienda y BOPIS
fr: En magasin et BOPIS
hi: इन-स्टोर और BOPIS

source: View Cart
ar: عرض العربة
es: Ver carrito
fr: Voir le panier
hi: टोकरी देखें

source: NEXUS RETAIL
ar: نيكزس للبيع بالتجزئة
es: NEXO MINORISTA
fr: NEXUS DÉTAIL
hi: नेक्सस रिटेल

source: Secure payment via Razorpay
ar: الدفع الآمن عبر Razorpay
es: Pago seguro a través de Razorpay
fr: Paiement sécurisé via Razorpay
hi: रेज़रपे के माध्यम से सुरक्षित भुगतान

source: Other Payment Modes
ar: طرق الدفع الأخرى
es: Otros modos de pago
fr: Autres modes de paiement
hi: अन्य भुगतान मोड

source: NEXUS PAY
ar: نيكزس باي
es: PAGO NEXO
fr: PAIEMENT NEXUS
hi: नेक्सस भुगतान

source: WAITING FOR CARD...
ar: في انتظار البطاقة...
es: ESPERANDO TARJETA...
fr: EN ATTENTE DE CARTE...
hi: कार्ड की प्रतीक्षा में...

source: Insert, Tap, or Swipe
ar: أدخل أو اضغط أو اسحب
es: Insertar, tocar o deslizar
fr: Insérer, appuyer ou glisser
hi: सम्मिलित करें, टैप करें या स्वाइप करें

source: AUTHORIZING...
ar: التفويض...
es: AUTORIZANDO...
fr: AUTORISER...
hi: प्राधिकृत करना...

source: APPROVED
ar: موافقة
es: APROBADO
fr: APPROUVÉ
hi: अनुमत

source: Customer Action Required
ar: مطلوب إجراء العميل
es: Acción requerida por el cliente
fr: Action client requise
hi: ग्राहक कार्रवाई आवश्यक

source: Simulate Card Tap / Swipe
ar: محاكاة بطاقة الحنفية / انتقاد
es: Simular toque/deslizamiento de tarjeta
fr: Simuler une carte en tapant/glissant
hi: कार्ड टैप/स्वाइप का अनुकरण करें

source: Authorizing transaction securely...
ar: السماح بالمعاملة بشكل آمن...
es: Autorizando transacción de forma segura...
fr: Autoriser la transaction en toute sécurité...
hi: लेन-देन को सुरक्षित रूप से अधिकृत करना...

source: In Stock
ar: في الأوراق المالية
es: En stock
fr: En stock
hi: स्टॉक में

source: Share Digital Receipt
ar: مشاركة الإيصال الرقمي
es: Compartir recibo digital
fr: Partager le reçu numérique
hi: डिजिटल रसीद साझा करें

source: Share Receipt
ar: إيصال المشاركة
es: Compartir recibo
fr: Partager le reçu
hi: रसीद साझा करें

source: Complete Sale & Return
ar: استكمال البيع والإرجاع
es: Venta y devolución completas
fr: Vente et retour complets
hi: पूर्ण बिक्री एवं वापसी

source: Digital receipt shared successfully!
ar: تمت مشاركة الإيصال الرقمي بنجاح!
es: ¡Recibo digital compartido exitosamente!
fr: Reçu numérique partagé avec succès !
hi: डिजिटल रसीद सफलतापूर्वक साझा की गई!

source: Transaction Complete
ar: اكتملت المعاملة
es: Transacción completa
fr: Transaction terminée
hi: लेन-देन पूर्ण

source: Payment Authorized
ar: الدفع معتمد
es: Pago autorizado
fr: Paiement autorisé
hi: भुगतान प्राधिकृत

source: Official Store Receipt
ar: استلام المتجر الرسمي
es: Recibo oficial de la tienda
fr: Reçu de la boutique officielle
hi: आधिकारिक स्टोर रसीद

source: GST (18% incl.)
ar: ضريبة السلع والخدمات (شاملة 18%)
es: IVA (18% incluido)
fr: TPS (18% TTC)
hi: जीएसटी (18% सम्मिलित)

source: Total Paid
ar: إجمالي المبلغ المدفوع
es: Total pagado
fr: Total payé
hi: पूर्ण भुगतान

source: Thank you for shopping at Nexus Retail
ar: شكرًا لك على التسوق في Nexus Retail
es: Gracias por comprar en Nexus Retail
fr: Merci d'avoir fait vos achats chez Nexus Retail
hi: नेक्सस रिटेल पर खरीदारी के लिए धन्यवाद

source: For returns & exchanges visit any store within 30 days
ar: للاسترجاع والاستبدال، تفضل بزيارة أي متجر خلال 30 يومًا
es: Para devoluciones y cambios visite cualquier tienda dentro de los 30 días
fr: Pour les retours et les échanges, visitez n’importe quel magasin dans les 30 jours
hi: रिटर्न और एक्सचेंज के लिए 30 दिनों के भीतर किसी भी स्टोर पर जाएँ

source: Order History
ar: تاريخ الطلب
es: Historial de pedidos
fr: Historique des commandes
hi: आदेश इतिहास

source: No recent orders
ar: لا توجد طلبات حديثة
es: No hay pedidos recientes
fr: Aucune commande récente
hi: कोई हालिया आदेश नहीं

source: Recent Orders
ar: الطلبات الأخيرة
es: Pedidos recientes
fr: Commandes récentes
hi: हालिया आदेश

source: POS Transaction History
ar: تاريخ معاملات نقاط البيع
es: Historial de transacciones de POS
fr: Historique des transactions au point de vente
hi: पीओएस लेनदेन इतिहास

source: GBP
fr: EUR

source: UPI (Google Pay, PhonePe, Bhim)
hi: यूपीआई (गूगल पे, फोनपे, भीम)
